export const EuropeData = [
  { country: '核心国',  
     area1957: 140,
     area1962: 140, 
     area1973: 185,     //加入英国、爱尔兰、丹麦后面积增加
     area1981: 200,     //加入希腊后面积增加
     area1985: 200, 
     area1986: 260,     //加入西班牙、葡萄牙
     area1990: 270,     //东德回归
     area1995: 350,     //加入奥地利、芬兰、瑞典
     area2004: 420,     //加入10国
     area2007: 425,     //加入罗马尼亚、保加利亚
     area2013: 430,     //加入克罗地亚
     area2019: 410 },   //英国脱欧
  { country: '非核心国',  //包括成员国在欧洲之外的殖民地面积
    area1957: 250, 
    area1962: 10,      //法国殖民地阿尔及利亚独立
    area1973: 210,     //格陵兰岛随丹麦加入EEC
    area1981: 210,      
    area1985: 0,      //格陵兰退出EEC
    area1986: 0, 
    area1990: 0, 
    area1995: 0, 
    area2004: 0, 
    area2007: 0, 
    area2013: 0, 
    area2019: 0 }   
];

export const joinExit1 = {      // 核心国变化
  1957: { join: ['法国', '意大利', '西德', '比利时', '荷兰', '卢森堡'] },
  1973: { join: ['英国', '爱尔兰', '丹麦'] },
  1981: { join: ['希腊'] },
  1986: { join: ['西班牙', '葡萄牙'] },
  1990: { join: ['东德（德国统一）'] },
  1995: { join: ['奥地利', '芬兰', '瑞典'] },
  1995: { exit: ['还有第二次（挪威人投票否决加入EU）'] },
  2004: { join: ['爱沙尼亚', '拉脱维亚', '立陶宛', '波兰', '捷克', '斯洛伐克', '匈牙利', '斯洛文尼亚', '马耳他', '塞浦路斯'] },
  2007: { join: ['罗马尼亚', '保加利亚'] },
  2013: { join: ['克罗地亚'] },
  2019: { exit: ['英国'] }
};

 export const joinExit2 = {     // 非核心国变化
  1962: { exit: ['阿尔及利亚从法国独立'] },
  1973: { join: ['格陵兰岛随丹麦加入EEC','挪威人投票否决加入EEC，但不只一次...'] },
  1985: { exit: ['格陵兰退出EEC'] }
 };

 export const Exist = {         //现存核心成员国
  1957: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡'] },
  1962: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡'] },
  1973: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','格陵兰'] },
  1981: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','格陵兰'] },
  1985: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊'] },
  1986: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙'] },
  1990: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙','东德（德国统一）'] },
  1995: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典'] },
  2004: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典',
    '爱沙尼亚','拉脱维亚','立陶宛','波兰','捷克','斯洛伐克','匈牙利','斯洛文尼亚','马耳他','塞浦路斯'] },
  2007: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典',
    '爱沙尼亚','拉脱维亚','立陶宛','波兰','捷克','斯洛伐克','匈牙利','斯洛文尼亚','马耳他','塞浦路斯','罗马尼亚','保加利亚'] },
  2013: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','英国','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典',
    '爱沙尼亚','拉脱维亚','立陶宛','波兰','捷克','斯洛伐克','匈牙利','斯洛文尼亚','马耳他','塞浦路斯','罗马尼亚','保加利亚','克罗地亚'] },
  2019: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典','爱沙尼亚',
    '拉脱维亚','立陶宛','波兰','捷克','斯洛伐克','匈牙利','斯洛文尼亚','马耳他','塞浦路斯','罗马尼亚','保加利亚','克罗地亚'] },
  2025: { exist: ['法国','意大利','西德','比利时','荷兰','卢森堡','爱尔兰','丹麦','希腊','西班牙','葡萄牙','奥地利','芬兰','瑞典','爱沙尼亚',
    '拉脱维亚','立陶宛','波兰','捷克','斯洛伐克','匈牙利','斯洛文尼亚','马耳他','塞浦路斯','罗马尼亚','保加利亚','克罗地亚'] }
 };

// 当前欧盟（2025）补充数据
export const CurrentEU = {
  year: 2025,
  '核心国-不变': 414,  
  '核心国-增量': 0,
  '核心国-减量': 0,
  '非核心国-不变': 0,
  '非核心国-增量': 0,
  '非核心国-减量': 0,
  events: { join: ['（当前27国）'] }
};

